lib/tasks/dev.rake

  task setup: :environment do


    kinds = %w(Amigo Comercial Conhecido)

    kinds.each do |kind|
      Kind.create(
        description: kind
      )
    end


    100.times do |i|
      Contact.create!(
        name:Faker::Name.name ,
        email:Faker::Internet.email,
        birthdate: Faker::Date.birthday(min_age: 18, max_age: 65),
        kind: Kind.all.sample
      )
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2020-12-31 02:43:39.287953"], ["updated_at", "2020-12-31 02:43:39.287953"]]
INSERT INTO "contacts" ("name", "email", "birthdate", "created_at", "updated_at", "kind_id") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2020-12-31 02:40:58.015383"], ["updated_at", "2020-12-31 02:40:58.015383"]]
SELECT "kinds".* FROM "kinds"